// ====================================================== defer async ======================================================
// *! 	<script src="./js/script.js" defer></script>
// * defer поставит на загрузку файл со js запустит файл со js после загрузки html страницы
// * async поставит на загрузку файл со js запускает html после загрузки файла js останавливает загрузку html запускает js файл
// * работает только для внешних сылок
// ====================================================== defer async ======================================================